[
  {
    "type": "event",
    "date": 1394536683256,
    "artist": {
      "id": "55f74fee0f3a72cc79440827",
      "name": "Ratatat"
    },
    "venue": {
      "id": "a1a069c2-b5bf-422b-8524-7ec41ab41c70",
      "name": "The ShowBox: Market",
      "Location": {
        "type": "Point",
        "coordinates": [
          47.608414,
          -122.339704
        ]
      }
    },
    "id": "b839ab75-2192-b38f-72f0-335c737c1eef"
  },
  {
    "type": "event",
    "date": 1439790579189,
    "artist": {
      "id": "55f74feeca89496ace9869cf",
      "name": "Justice"
    },
    "venue": {
      "id": "a1a069c2-b5bf-422b-8524-7ec41ab41c70",
      "name": "The ShowBox: Market",
      "Location": {
        "type": "Point",
        "coordinates": [
          47.608414,
          -122.339704
        ]
      }
    },
    "id": "06a5837d-517e-f06b-c308-8d61c33d1c84"
  },
  {
    "type": "event",
    "date": 1433853118904,
    "artist": {
      "id": "55f74fee423589deb97404b9",
      "name": "Daft Punk"
    },
    "venue": {
      "id": "a1a069c2-b5bf-422b-8524-7ec41ab41c70",
      "name": "The ShowBox: Market",
      "Location": {
        "type": "Point",
        "coordinates": [
          47.608414,
          -122.339704
        ]
      }
    },
    "id": "38c9870d-3680-776a-39ed-dbf82e0a5ef2"
  },
  {
    "type": "event",
    "date": 1419415152336,
    "artist": {
      "id": "55f74feeb556b6c2c5e0f079",
      "name": "Major Lazer"
    },
    "venue": {
      "id": "a1a069c2-b5bf-422b-8524-7ec41ab41c70",
      "name": "The ShowBox: Market",
      "Location": {
        "type": "Point",
        "coordinates": [
          47.608414,
          -122.339704
        ]
      }
    },
    "id": "7ffc0e26-96e1-42b5-594c-3a7085b58f5a"
  },
  {
    "type": "event",
    "date": 1428890896970,
    "artist": {
      "id": "55f74fee1670762071852ae1",
      "name": "Dillon Francis"
    },
    "venue": {
      "id": "a1a069c2-b5bf-422b-8524-7ec41ab41c70",
      "name": "The ShowBox: Market",
      "Location": {
        "type": "Point",
        "coordinates": [
          47.608414,
          -122.339704
        ]
      }
    },
    "id": "18ea2e05-53bc-65c5-de99-69a3c450e39f"
  },
  {
    "type": "event",
    "date": 1412874677085,
    "artist": {
      "id": "55f74fee4d30ac7951e0ed4a",
      "name": "Radiohead"
    },
    "venue": {
      "id": "87f51842-8306-4caa-bbf2-e244e2df14e5",
      "name": "The Showbox: SODO",
      "Location": {
        "type": "Point",
        "coordinates": [
          47.587925,
          -122.334207
        ]
      }
    },
    "id": "ca698c94-2519-7b7b-a604-8563103ef092"
  },
  {
    "type": "event",
    "date": 1393091231267,
    "artist": {
      "id": "55f74feec2852ac755734467",
      "name": "The Who"
    },
    "venue": {
      "id": "87f51842-8306-4caa-bbf2-e244e2df14e5",
      "name": "The Showbox: SODO",
      "Location": {
        "type": "Point",
        "coordinates": [
          47.587925,
          -122.334207
        ]
      }
    },
    "id": "3fc924de-79a8-960e-bf38-2cd6c9dc7073"
  },
  {
    "type": "event",
    "date": 1392364760844,
    "artist": {
      "id": "55f74fee935860c33988739c",
      "name": "Def Leppard"
    },
    "venue": {
      "id": "87f51842-8306-4caa-bbf2-e244e2df14e5",
      "name": "The Showbox: SODO",
      "Location": {
        "type": "Point",
        "coordinates": [
          47.587925,
          -122.334207
        ]
      }
    },
    "id": "a87f740c-1517-85cb-fe5f-2f0bdf6fb6b4"
  },
  {
    "type": "event",
    "date": 1440863949563,
    "artist": {
      "id": "55f74fee0c0a63d5eed1b5ae",
      "name": "Hollywood Undead"
    },
    "venue": {
      "id": "87f51842-8306-4caa-bbf2-e244e2df14e5",
      "name": "The Showbox: SODO",
      "Location": {
        "type": "Point",
        "coordinates": [
          47.587925,
          -122.334207
        ]
      }
    },
    "id": "26d16b7a-9ff3-155e-45da-8e83eb8d1e82"
  },
  {
    "type": "event",
    "date": 1396761821892,
    "artist": {
      "id": "55f74fee4c8151108473d4f3",
      "name": "Empire of the Sun"
    },
    "venue": {
      "id": "87f51842-8306-4caa-bbf2-e244e2df14e5",
      "name": "The Showbox: SODO",
      "Location": {
        "type": "Point",
        "coordinates": [
          47.587925,
          -122.334207
        ]
      }
    },
    "id": "a0c869f1-48d5-88da-34c2-a158fb07bd5d"
  },
  {
    "type": "comment",
    "eventid": "b839ab75-2192-b38f-72f0-335c737c1eef",
    "commentText": "Awesome venue for a show, the whole place is pretty close to the stage. There's a lower floor and bars on both sides. The whole place feels close to the stage. I came here for a Jurrasic 5 show and I will definitely be checking for more shows coming up.",
    "user": {
      "id": "55f75ae344666679a4b2c891",
      "firstname": "Madden",
      "lastname": "Brock"
    },
    "id": "40a9d5d7-5010-57fd-9e4a-cc4e5d4b538c"
  },
  {
    "type": "comment",
    "eventid": "b839ab75-2192-b38f-72f0-335c737c1eef",
    "commentText": "I love this venue. I've seen shows in small intimate venues in nyc, Boston, DC, San Diego, Jersey, and Philly, and the Showbox is probably tied as my favorite. From rock bands, to hip-hop, indie, and alternative shows, I have always enjoyed this space. The musicians can usually feel the warmth of the Seattle welcome here as well. The sound is fabulous and the ambiance of the Art Deco era is the perfect environment for a concert. \nThe restrooms (women left of stage, men right) are plentiful and clean, and the bars offer several microbrews as well as full service drinks. Food here is decent, and if you're wanting a quieter space to eat and listen to music you can always eat in the Showbox restaurant/bar right by the entrance. \nIn true old-timey fashion they also have a photo booth in the back corner for documenting your night between acts! Love love love this space! Looking forward to many more shows here!",
    "user": {
      "id": "55f75ae4d83d33e8e3d0ced4",
      "firstname": "Dyer",
      "lastname": "Mathews"
    },
    "id": "8302bfa4-0107-b286-533f-7c0d4012b14b"
  },
  {
    "type": "comment",
    "eventid": "b839ab75-2192-b38f-72f0-335c737c1eef",
    "commentText": "Showbox at the Market is an awesome venue to see your favourite band play. It's deceptively big and open, considering the place looks pretty small on the outside; there's a seating area and booths near the bar; the whole place is pretty clean; and no matter where you are, you feel close to the stage. Whether I was waiting for a drink at the bar or fighting off fellow vicious fans in the moshpit, I felt like I had a good view of the show. \nOn top of being a good venue in general, I was pretty impressed with the customer service. The band I went see (Dir en grey) couldn't make their original show date because their bus broke down or something. I was extremely upset and worried that the show would be cancelled, or tickets would be non-refundable, but the venue pushed the show to the same time next day. We didn't have to get new tickets or anything!  \nWhen doors opened, they collected tickets fast and got everyone in in a timely manner, so it did not delay the show. Even though people were literally lined up around the block to get in, we were inside in a matter of 20 minutes. \nIt was because of my awesome experience at the Showbox that I had no problem shelling out to see Dir en grey play here again this year... and I fly in from Hawaii to see them. \nThanks for being so awesome, and bringing a variety of different performers to Seattle, Showbox!!",
    "user": {
      "id": "55f75ae4699d60c463e367f4",
      "firstname": "Burgess",
      "lastname": "Morrow"
    },
    "id": "ce5842e3-3db1-97ed-74be-47e72a0871f5"
  },
  {
    "type": "comment",
    "eventid": "b839ab75-2192-b38f-72f0-335c737c1eef",
    "commentText": "Their hours for their ticket office is a JOKE!!! Open only Wednesday's and Friday's from 10am - 2pm. I can't believe they are seriously only open twice a week for 4 hours. I'm flabbergasted.\nToday I got off work at 1:30pm, shot over to Seattle and made it to Showbox by 1:55 only to be told they are incurring technical issues and they are unable to help at all and won't be able to help me til next Wednesday, Unacceptable!!! So how long was the ticket office open this week? Less than 8 hours? SHOWBOX TICKET OFFICE IS SUCH TRASH!!!\nI would recommend not attending anything hosted at either Showbox venues!!! Hope the business goes under.",
    "user": {
      "id": "55f75ae43e8564158add224c",
      "firstname": "Mccarthy",
      "lastname": "Sosa"
    },
    "id": "b4e4061e-6064-f577-cfd3-b748ef5e6262"
  },
  {
    "type": "comment",
    "eventid": "b839ab75-2192-b38f-72f0-335c737c1eef",
    "commentText": "Saw an old favorite band at this venue! I've been to smaller and bigger ones, this was on the hand of smallish-big. There is a large floor you can stand on and listen to bands play, and then 4-5 various seating areas! THIS was nice, you're not forced to stand the entire time waiting for the opening band, was great.\nAlthough, I think the far right spot where I sat was great, but the sound bounced off the walls a weird way, may not have been the most ideal spot, but it was great because it was right by one of the bars, and on a ledge so people standing wouldn't be in your direct eye line. \nSo all in all, if you love a band that will be performing here, you must see them. It's a much more intimate experience! :)",
    "user": {
      "id": "55f75ae47223d514ce5528b8",
      "firstname": "Dominguez",
      "lastname": "Pickett"
    },
    "id": "7d3a33b5-92ef-7c29-8100-8353fc82495b"
  },
  {
    "type": "comment",
    "eventid": "b839ab75-2192-b38f-72f0-335c737c1eef",
    "commentText": "The Showbox gets really great bands from across the music spectra (rock, punk, hip hop, metal) and has great sound, great sight lines and great lights. Also easy access to nice big bar areas for the grown-ups (most shows are all ages, which is GREAT for the music scene). Huge main floor area where you can stand back and watch or get up close and do that run-into-everybody 'dance' thing that somehow is still popular after all of these decades. And the nice high ceiling usually means you're not going to roast while you're watching a show, even if it's sold out.\nDrinks are tasty and boozy and reasonably priced, and bartenders are friendly! Wow! That never happens at a rock club!\nOnly knocks: it's right in the heart of downtown, which means parking is a pain in the butt, and ticket prices are generally pretty high. Not like Eagles Reunion Tour high, but certainly 2 or 3 times more than a show at the Sunset or the Crocodile.",
    "user": {
      "id": "55f75ae4adf09611eeff411f",
      "firstname": "Deborah",
      "lastname": "Terrell"
    },
    "id": "59bb581c-6e0f-fef1-78d2-3e78109be355"
  },
  {
    "type": "comment",
    "eventid": "b839ab75-2192-b38f-72f0-335c737c1eef",
    "commentText": "This place has improved a lot from the last I remembered.  It's  much cleaner and better lighting too.  The Crew (especially)  working  this time are much attentive and friendly. The show last night was off the hook with Etana performing (Love her..hope to see her soon) and\n 'Anuhea'?  Great venue, tickets were very reasonable for several acts that went on prior and were also very entertaining.  I didn't mind the short intermissions, still got to dance here,and there, and bumped in to a lot of friends.  Good times!\nI can't wait for my next venue...",
    "user": {
      "id": "55f75ae4f6f8a1cffd3e87af",
      "firstname": "Adriana",
      "lastname": "Ayers"
    },
    "id": "0978a7c6-338e-54eb-4373-ac40f35b7eeb"
  },
  {
    "type": "comment",
    "eventid": "b839ab75-2192-b38f-72f0-335c737c1eef",
    "commentText": "Went to a show last night and they came onstage and hauled away the drum kit and keyboard during The Church's final song. Showbox management is to blame. Never in all my life have I seen that happen! They were 2 min over end time. BFD.",
    "user": {
      "id": "55f75ae4b5573500426b30bd",
      "firstname": "Erica",
      "lastname": "Lara"
    },
    "id": "04495420-0b13-4b24-d578-dd09987c514d"
  },
  {
    "type": "comment",
    "eventid": "b839ab75-2192-b38f-72f0-335c737c1eef",
    "commentText": "Great place to c a show. Not much to review since your entire experience is aboot the band. The staff is great the place is clean...uhhh..this is hard since this place changes with the bands",
    "user": {
      "id": "55f75ae4034bbe5b6f7366bc",
      "firstname": "Nielsen",
      "lastname": "Hampton"
    },
    "id": "82faab83-9218-f982-83ed-20dc6b4cdce3"
  },
  {
    "type": "comment",
    "eventid": "b839ab75-2192-b38f-72f0-335c737c1eef",
    "commentText": "My husband and I went to The Church and Psychedelic Furs concert this week.  Good show. BEST customer service from the Showbox staff.  We were former VIP customers until the annual subscription priced us out of to the market.  For the show we bought VIP seats to enjoy a table view. Those standing directly behind us were drunk, loud and rude.  Several people kept sitting at the empty table next to us.  As the evening progressed they became more obnoxious.  Once i let the manager know, she immediately corrected the situation.\nThanks Showbox for great service and a fun show!",
    "user": {
      "id": "55f75ae476e75745e9abc316",
      "firstname": "Phoebe",
      "lastname": "Waller"
    },
    "id": "c43a36c7-0f91-2504-9d14-2a9d3c256c08"
  }]